create_clock -name clk -period 10 {}
set_input_delay -clock clk 0 {
G9
G8
G7
G6
G5
G41
G40
G4
G39
G38
G37
G36
G35
G34
G33
G32
G31
G30
G3
G29
G28
G27
G26
G25
G24
G23
G22
G21
G20
G2
G19
G18
G17
G16
G15
G14
G13
G12
G11
G10
G1
}
set_output_delay -clock clk 0 {
G1355
G1354
G1353
G1352
G1351
G1350
G1349
G1348
G1347
G1346
G1345
G1344
G1343
G1342
G1341
G1340
G1339
G1338
G1337
G1336
G1335
G1334
G1333
G1332
G1331
G1330
G1329
G1328
G1327
G1326
G1325
G1324
}
