create_clock -name clk -period 10 {}
set_input_delay -clock clk 0 {
N99
N94
N91
N88
N85
N82
N79
N76
N72
N7
N69
N66
N63
N60
N56
N53
N49
N46
N43
N40
N4
N37
N34
N31
N28
N25
N22
N19
N16
N13
N104
N10
N1
}
set_output_delay -clock clk 0 {
N2899
N2892
N2891
N2890
N2889
N2888
N2887
N2886
N2811
N2787
N2786
N2785
N2784
N2783
N2782
N2781
N2780
N2779
N2768
N2767
N2762
N2756
N2755
N2754
N2753
}
