create_clock -name clk -period 10 {}
set_input_delay -clock clk 0 {
N99
N96
N95
N94
N93
N92
N91
N90
N89
N88
N87
N86
N85
N82
N81
N80
N8
N79
N78
N77
N76
N75
N74
N73
N72
N7
N69
N68
N67
N66
N65
N64
N63
N62
N61
N60
N6
N57
N56
N55
N54
N53
N52
N51
N50
N5
N49
N48
N47
N44
N43
N40
N4
N37
N36
N355
N352
N35
N349
N346
N343
N340
N34
N337
N334
N331
N33
N328
N325
N322
N32
N319
N316
N313
N309
N305
N301
N3
N297
N294
N290
N29
N287
N284
N281
N28
N278
N275
N272
N27
N269
N266
N263
N262
N26
N259
N256
N253
N25
N246
N241
N24
N237
N234
N231
N230
N23
N227
N224
N22
N219
N218_I
N217_I
N216_I
N215_I
N214_I
N213_I
N212_I
N211_I
N210_I
N21
N209_I
N208_I
N207_I
N206_I
N205_I
N204_I
N203_I
N202_I
N201_I
N200_I
N20
N2
N199_I
N198_I
N197_I
N196_I
N195_I
N194_I
N193_I
N192_I
N191_I
N190_I
N19
N189_I
N188_I
N187_I
N186_I
N185_I
N184_I
N183_I
N182_I
N181_I
N180_I
N179_I
N178_I
N177_I
N176_I
N175_I
N174_I
N173_I
N172_I
N171_I
N170_I
N169_I
N168_I
N167_I
N166_I
N165_I
N164_I
N163_I
N162_I
N161_I
N160_I
N16
N159_I
N158_I
N157_I
N156_I
N155_I
N154_I
N153_I
N152_I
N151_I
N150_I
N15
N149_I
N148_I
N147_I
N146_I
N145_I
N144_I
N143_I
N142
N141
N140
N14
N139
N138
N137
N136
N135
N132
N131
N130
N129
N128
N127
N126
N125
N124
N123
N120
N119
N118
N117
N116
N115
N114
N113
N112
N111
N11
N108
N107
N106
N105
N104
N103
N102
N101
N100
N1
}
set_output_delay -clock clk 0 {
N805
N799
N792
N494
N493
N492
N491
N490
N489
N488
N487
N458
N457
N456
N420
N419
N401
N400
N398
N3882
N3881
N3875
N3851
N3809
N3804
N3803
N3671
N3546
N3079
N3038
N2971
N2970
N2925
N2891
N2644
N2643
N2496
N2390
N2389
N2388
N2387
N218_O
N217_O
N216_O
N215_O
N214_O
N213_O
N212_O
N211_O
N210_O
N209_O
N208_O
N207_O
N206_O
N205_O
N204_O
N203_O
N202_O
N2022
N2020
N201_O
N2018
N2016
N2014
N2012
N2010
N200_O
N199_O
N198_O
N197_O
N1971
N1970
N196_O
N1969
N195_O
N194_O
N193_O
N192_O
N191_O
N190_O
N189_O
N188_O
N187_O
N186_O
N185_O
N184_O
N183_O
N182_O
N1821
N1820
N181_O
N1819
N1818
N1817
N1816
N180_O
N179_O
N178_O
N177_O
N176_O
N175_O
N174_O
N173_O
N172_O
N1726
N171_O
N170_O
N169_O
N168_O
N167_O
N166_O
N165_O
N164_O
N163_O
N162_O
N161_O
N160_O
N159_O
N158_O
N157_O
N156_O
N155_O
N154_O
N153_O
N152_O
N151_O
N150_O
N149_O
N148_O
N147_O
N146_O
N145_O
N144_O
N1448
N143_O
N1277
N1269
N1029
N1028
N1026
}
