create_clock -name clk -period 10 {}
set_input_delay -clock clk 0 {
N97
N87
N77
N68
N58
N50
N45
N41
N350
N349
N343
N330
N33
N329
N326
N322
N317
N311
N303
N294
N283
N274
N270
N264
N257
N250
N244
N238
N232
N226
N223
N222
N213
N200
N20
N190
N179
N169
N159
N150
N143
N137
N132
N13
N128
N125
N124
N116
N107
N1
}
set_output_delay -clock clk 0 {
N5361
N5360
N5231
N5192
N5121
N5120
N5102
N5078
N5047
N5045
N5002
N4944
N4815
N4667
N4589
N4145
N4028
N3987
N3833
N3195
N1947
N1713
}
