create_clock -name clk -period 10 {}
set_input_delay -clock clk 0 {
G9
G8
G7
G6
G50
G5
G49
G48
G47
G46
G45
G44
G43
G42
G41
G40
G4
G39
G38
G37
G36
G35
G34
G33
G32
G31
G30
G3
G29
G28
G27
G26
G25
G24
G23
G22
G21
G20
G2
G19
G18
G17
G16
G15
G14
G13
G12
G11
G10
G1
}
set_output_delay -clock clk 0 {
G3540
G3539
G3538
G3537
G3536
G3535
G3534
G3533
G3532
G3531
G3530
G3529
G3528
G3527
G3526
G3525
G3524
G3523
G3522
G3521
G3520
G3519
}
