create_clock -name clk -period 10 {}
set_input_delay -clock clk 0 {
N97
N93
N9
N89
N85
N81
N77
N73
N69
N65
N61
N57
N53
N5
N49
N45
N41
N37
N33
N29
N25
N21
N17
N137
N136
N135
N134
N133
N132
N131
N130
N13
N129
N125
N121
N117
N113
N109
N105
N101
N1
}
set_output_delay -clock clk 0 {
N755
N754
N753
N752
N751
N750
N749
N748
N747
N746
N745
N744
N743
N742
N741
N740
N739
N738
N737
N736
N735
N734
N733
N732
N731
N730
N729
N728
N727
N726
N725
N724
}
