create_clock -name clk -period 10 {}
set_input_delay -clock clk 0 {
N86
N69
N528
N52
N511
N494
N477
N460
N443
N426
N409
N392
N375
N358
N35
N341
N324
N307
N290
N273
N256
N239
N222
N205
N188
N18
N171
N154
N137
N120
N103
N1
}
set_output_delay -clock clk 0 {
N6288
N6287
N6280
N6270
N6260
N6250
N6240
N6230
N6220
N6210
N6200
N6190
N6180
N6170
N6160
N6150
N6123
N5971
N5672
N545
N5308
N4946
N4591
N4241
N3895
N3552
N3211
N2877
N2548
N2223
N1901
N1581
}
