create_clock -name clk -period 10 {}
set_input_delay -clock clk 0 {
G99
G98
G97
G96
G95
G94
G93
G92
G91
G90
G9
G89
G88
G87
G86
G85
G84
G83
G82
G81
G80
G8
G79
G78
G77
G76
G75
G74
G73
G72
G71
G70
G7
G69
G68
G67
G66
G65
G64
G63
G62
G61
G60
G6
G59
G58
G57
G56
G55
G54
G53
G52
G51
G50
G5
G49
G48
G47
G46
G45
G44
G43
G42
G41
G40
G4
G39
G38
G37
G36
G35
G34
G33
G32
G31
G30
G3
G29
G28
G27
G26
G25
G24
G23
G22
G21
G20
G2
G19
G18
G178
G177
G176
G175
G174
G173
G172
G171
G170
G17
G169
G168
G167
G166
G165
G164
G163
G162
G161
G160
G16
G159
G158
G157
G156
G155
G154
G153
G152
G151
G150
G15
G149
G148
G147
G146
G145
G144
G143
G142
G141
G140
G14
G139
G138
G137
G136
G135
G134
G133
G132
G131
G130
G13
G129
G128
G127
G126
G125
G124
G123
G122
G121
G120
G12
G119
G118
G117
G116
G115
G114
G113
G112
G111
G110
G11
G109
G108
G107
G106
G105
G104
G103
G102
G101
G100
G10
G1
}
set_output_delay -clock clk 0 {
G5315
G5314
G5313
G5312
G5311
G5310
G5309
G5308
G5307
G5306
G5305
G5304
G5303
G5302
G5301
G5300
G5299
G5298
G5297
G5296
G5295
G5294
G5293
G5292
G5291
G5290
G5289
G5288
G5287
G5286
G5285
G5284
G5283
G5282
G5281
G5280
G5279
G5278
G5277
G5276
G5275
G5274
G5273
G5272
G5271
G5270
G5269
G5268
G5267
G5266
G5265
G5264
G5263
G5262
G5261
G5260
G5259
G5258
G5257
G5256
G5255
G5254
G5253
G5252
G5251
G5250
G5249
G5248
G5247
G5246
G5245
G5244
G5243
G5242
G5241
G5240
G5239
G5238
G5237
G5236
G5235
G5234
G5233
G5232
G5231
G5230
G5229
G5228
G5227
G5226
G5225
G5224
G5223
G5222
G5221
G5220
G5219
G5218
G5217
G5216
G5215
G5214
G5213
G5212
G5211
G5210
G5209
G5208
G5207
G5206
G5205
G5204
G5203
G5202
G5201
G5200
G5199
G5198
G5197
G5196
G5195
G5194
G5193
}
