create_clock -name clk -period 10 {}
set_input_delay -clock clk 0 {
N97
N94
N9
N89
N88
N87
N86
N85
N84
N83
N82
N81
N80
N79
N78
N77
N76
N75
N74
N73
N70
N69
N66
N65
N64
N63
N62
N61
N60
N59
N58
N57
N56
N55
N54
N53
N50
N5
N47
N44
N41
N382
N38
N367
N364
N361
N358
N355
N352
N35
N349
N346
N343
N340
N337
N334
N331
N328
N325
N322
N32
N319
N316
N313
N310
N307
N303
N299
N296
N293
N29
N289
N286
N283
N280
N277
N274
N271
N267
N263
N260
N26
N257
N254
N251
N248
N245
N242
N241_I
N240
N239
N238
N237
N236
N235
N234
N233
N232
N231
N230
N23
N229
N228
N227
N226
N225
N224
N223
N222
N221
N220
N219
N218
N217
N216
N215
N214
N213
N212
N211
N210
N209
N208
N207
N206
N205
N204
N203
N202
N201
N200
N199
N198
N197
N196
N195
N194
N193
N192
N191
N190
N189
N188
N187
N186
N185
N184
N183
N182
N181
N180
N18
N179
N178
N177
N176
N175
N174
N173
N172
N171
N170
N169
N168
N167
N166
N165
N164
N163
N162
N161
N160
N159
N158
N157
N156
N155
N154
N153
N152
N151
N150
N15
N147
N144
N141
N138
N135
N134
N133
N130
N127
N124
N121
N12
N118
N115
N114
N113
N112
N111
N110
N109
N106
N103
N100
N1
}
set_output_delay -clock clk 0 {
N945
N889
N885
N884
N883
N882
N881
N813
N707
N643
N582
N573
N571
N569
N567
N565
N563
N561
N559
N556
N553
N551
N549
N547
N545
N543
N541
N539
N537
N535
N519
N517
N515
N513
N511
N509
N507
N505
N501
N492
N489
N486
N484
N482
N478
N388
N387
N241_O
N1781
N1490
N1489
N11342
N11340
N11334
N11333
N1114
N1113
N1112
N1111
N1110
N10908
N10907
N10906
N10905
N10871
N10870
N10869
N10868
N10840
N10839
N10838
N10837
N10827
N10763
N10762
N10761
N10760
N10759
N10729
N10718
N10717
N10716
N10715
N10714
N10713
N10712
N10711
N10706
N10704
N10641
N10632
N10628
N10576
N10575
N10574
N10353
N10352
N10351
N10350
N10112
N10111
N10110
N10109
N10104
N10103
N10102
N10101
N10025
}
