create_clock -name clk -period 10 {}
set_input_delay -clock clk 0 {
N96
N91
N90
N89
N88
N87
N86
N85
N80
N8
N75
N74
N73
N72
N68
N59
N55
N51
N42
N36
N29
N268
N267
N261
N260
N26
N259
N255
N246
N237
N228
N219
N210
N207
N201
N195
N189
N183
N177
N171
N17
N165
N159
N156
N153
N152
N149
N146
N143
N138
N135
N130
N13
N126
N121
N116
N111
N106
N101
N1
}
set_output_delay -clock clk 0 {
N880
N879
N878
N874
N866
N865
N864
N863
N850
N768
N767
N450
N449
N448
N447
N446
N423
N422
N421
N420
N419
N418
N391
N390
N389
N388
}
