create_clock -name clk -period 10 {}
set_input_delay -clock clk 0 {
shift[6]
shift[5]
shift[4]
shift[3]
shift[2]
shift[1]
shift[0]
a[9]
a[99]
a[98]
a[97]
a[96]
a[95]
a[94]
a[93]
a[92]
a[91]
a[90]
a[8]
a[89]
a[88]
a[87]
a[86]
a[85]
a[84]
a[83]
a[82]
a[81]
a[80]
a[7]
a[79]
a[78]
a[77]
a[76]
a[75]
a[74]
a[73]
a[72]
a[71]
a[70]
a[6]
a[69]
a[68]
a[67]
a[66]
a[65]
a[64]
a[63]
a[62]
a[61]
a[60]
a[5]
a[59]
a[58]
a[57]
a[56]
a[55]
a[54]
a[53]
a[52]
a[51]
a[50]
a[4]
a[49]
a[48]
a[47]
a[46]
a[45]
a[44]
a[43]
a[42]
a[41]
a[40]
a[3]
a[39]
a[38]
a[37]
a[36]
a[35]
a[34]
a[33]
a[32]
a[31]
a[30]
a[2]
a[29]
a[28]
a[27]
a[26]
a[25]
a[24]
a[23]
a[22]
a[21]
a[20]
a[1]
a[19]
a[18]
a[17]
a[16]
a[15]
a[14]
a[13]
a[12]
a[127]
a[126]
a[125]
a[124]
a[123]
a[122]
a[121]
a[120]
a[11]
a[119]
a[118]
a[117]
a[116]
a[115]
a[114]
a[113]
a[112]
a[111]
a[110]
a[10]
a[109]
a[108]
a[107]
a[106]
a[105]
a[104]
a[103]
a[102]
a[101]
a[100]
a[0]
}
set_output_delay -clock clk 0 {
result[9]
result[99]
result[98]
result[97]
result[96]
result[95]
result[94]
result[93]
result[92]
result[91]
result[90]
result[8]
result[89]
result[88]
result[87]
result[86]
result[85]
result[84]
result[83]
result[82]
result[81]
result[80]
result[7]
result[79]
result[78]
result[77]
result[76]
result[75]
result[74]
result[73]
result[72]
result[71]
result[70]
result[6]
result[69]
result[68]
result[67]
result[66]
result[65]
result[64]
result[63]
result[62]
result[61]
result[60]
result[5]
result[59]
result[58]
result[57]
result[56]
result[55]
result[54]
result[53]
result[52]
result[51]
result[50]
result[4]
result[49]
result[48]
result[47]
result[46]
result[45]
result[44]
result[43]
result[42]
result[41]
result[40]
result[3]
result[39]
result[38]
result[37]
result[36]
result[35]
result[34]
result[33]
result[32]
result[31]
result[30]
result[2]
result[29]
result[28]
result[27]
result[26]
result[25]
result[24]
result[23]
result[22]
result[21]
result[20]
result[1]
result[19]
result[18]
result[17]
result[16]
result[15]
result[14]
result[13]
result[12]
result[127]
result[126]
result[125]
result[124]
result[123]
result[122]
result[121]
result[120]
result[11]
result[119]
result[118]
result[117]
result[116]
result[115]
result[114]
result[113]
result[112]
result[111]
result[110]
result[10]
result[109]
result[108]
result[107]
result[106]
result[105]
result[104]
result[103]
result[102]
result[101]
result[100]
result[0]
}
