create_clock -name clk -period 10 {}
set_input_delay -clock clk 0 {
G9
G8
G7
G6
G5
G4
G33
G32
G31
G30
G3
G29
G28
G27
G26
G25
G24
G23
G22
G21
G20
G2
G19
G18
G17
G16
G15
G14
G13
G12
G11
G10
G1
}
set_output_delay -clock clk 0 {
G1908
G1907
G1906
G1905
G1904
G1903
G1902
G1901
G1900
G1899
G1898
G1897
G1896
G1895
G1894
G1893
G1892
G1891
G1890
G1889
G1888
G1887
G1886
G1885
G1884
}
