create_clock -name clk -period 10 {}
set_input_delay -clock clk 0 {
G99
G98
G97
G96
G95
G94
G93
G92
G91
G90
G9
G89
G88
G87
G86
G85
G84
G83
G82
G81
G80
G8
G79
G78
G77
G76
G75
G74
G73
G72
G71
G70
G7
G69
G68
G67
G66
G65
G64
G63
G62
G61
G60
G6
G59
G58
G57
G56
G55
G54
G53
G52
G51
G50
G5
G49
G48
G47
G46
G45
G44
G43
G42
G41
G40
G4
G39
G38
G37
G36
G35
G34
G33
G32
G31
G30
G3
G29
G28
G27
G26
G25
G24
G23
G22
G21
G20
G2
G19
G18
G17
G16
G157
G156
G155
G154
G153
G152
G151
G150
G15
G149
G148
G147
G146
G145
G144
G143
G142
G141
G140
G14
G139
G138
G137
G136
G135
G134
G133
G132
G131
G130
G13
G129
G128
G127
G126
G125
G124
G123
G122
G121
G120
G12
G119
G118
G117
G116
G115
G114
G113
G112
G111
G110
G11
G109
G108
G107
G106
G105
G104
G103
G102
G101
G100
G10
G1
}
set_output_delay -clock clk 0 {
G2594
G2593
G2592
G2591
G2590
G2589
G2588
G2587
G2586
G2585
G2584
G2583
G2582
G2581
G2580
G2579
G2578
G2577
G2576
G2575
G2574
G2573
G2572
G2571
G2570
G2569
G2568
G2567
G2566
G2565
G2564
G2563
G2562
G2561
G2560
G2559
G2558
G2557
G2556
G2555
G2554
G2553
G2552
G2551
G2550
G2549
G2548
G2547
G2546
G2545
G2544
G2543
G2542
G2541
G2540
G2539
G2538
G2537
G2536
G2535
G2534
G2533
G2532
G2531
}
