create_clock -name clk -period 10 {}
set_input_delay -clock clk 0 {
N99
N95
N92
N89
N86
N82
N8
N79
N76
N73
N69
N66
N63
N60
N56
N53
N50
N47
N43
N40
N4
N37
N34
N30
N27
N24
N21
N17
N14
N115
N112
N11
N108
N105
N102
N1
}
set_output_delay -clock clk 0 {
N432
N431
N430
N421
N370
N329
N223
}
