create_clock -name clk -period 10 {}
set_input_delay -clock clk 0 {
N97
N94
N91
N88
N87
N86
N83
N82
N81
N80
N79
N76
N73
N70
N67
N64
N631
N625
N619
N616
N613
N610
N61
N607
N603
N599
N598
N597
N596
N595
N592
N591
N588
N583
N580
N577
N574
N571
N566
N562
N559
N556
N552
N549
N545
N54
N534
N53
N523
N52
N514
N503
N490
N49
N479
N468
N46
N457
N446
N435
N43
N422
N411
N400
N40
N4
N389
N386
N374
N373
N372
N37
N369
N366
N361
N358
N351
N348
N341
N34
N338
N335
N332
N331
N324
N323
N316
N315
N31
N308
N307
N302
N299
N293
N292
N289
N288
N281
N280
N273
N272
N27
N265
N264
N26
N257
N254
N251
N25
N248
N245
N242
N241
N24
N234
N233
N23
N226
N225
N218
N217
N210
N209
N206
N203
N200
N20
N197
N194
N191
N188
N185
N182
N179
N176
N173
N170
N17
N167
N164
N161
N158
N155
N152
N149
N146
N145
N141
N140
N14
N137
N136
N135
N132
N131
N130
N129
N128
N127
N126
N123
N122
N121
N120
N119
N118
N117
N116
N115
N114
N113
N112
N11
N109
N106
N103
N100
N1
}
set_output_delay -clock clk 0 {
N816
N8128
N8127
N8124
N8123
N8076
N8075
N7761
N7760
N7759
N7758
N7757
N7756
N7755
N7754
N7742
N7741
N7740
N7739
N7738
N7737
N7736
N7735
N7707
N7706
N7705
N7704
N7703
N7702
N7701
N7700
N7699
N7698
N7626
N7607
N7606
N7605
N7604
N7603
N7602
N7601
N7600
N7522
N7521
N7520
N7519
N7518
N7517
N7516
N7515
N7511
N7506
N7504
N7503
N7476
N7474
N7473
N7472
N7471
N7470
N7469
N7467
N7466
N7465
N7449
N7432
N7365
N7363
N709
N7015
N6927
N6926
N6925
N6924
N6877
N6716
N6648
N6646
N6643
N6641
N5388
N5240
N4740
N4739
N4738
N4737
N4279
N4278
N4275
N4272
N3613
N3604
N3360
N3359
N3358
N3357
N2623
N2590
N2584
N2527
N2387
N2309
N2142
N2139
N2061
N2060
N2054
N1972
N1155
N1154
N1153
N1152
N1147
N1145
N1144
N1143
N1142
N1141
N1140
N1139
N1138
N1137
N1066
}
