create_clock -name clk -period 10 {}
set_input_delay -clock clk 0 {
pi146
pi145
pi144
pi143
pi142
pi141
pi140
pi139
pi138
pi137
pi136
pi135
pi134
pi133
pi132
pi131
pi130
pi129
pi128
pi127
pi126
pi125
pi124
pi123
pi122
pi121
pi120
pi119
pi118
pi117
pi116
pi115
pi114
pi113
pi112
pi111
pi110
pi109
pi108
pi107
pi106
pi105
pi104
pi103
pi102
pi101
pi100
pi099
pi098
pi097
pi096
pi095
pi094
pi093
pi092
pi091
pi090
pi089
pi088
pi087
pi086
pi085
pi084
pi083
pi082
pi081
pi080
pi079
pi078
pi077
pi076
pi075
pi074
pi073
pi072
pi071
pi070
pi069
pi068
pi067
pi066
pi065
pi064
pi063
pi062
pi061
pi060
pi059
pi058
pi057
pi056
pi055
pi054
pi053
pi052
pi051
pi050
pi049
pi048
pi047
pi046
pi045
pi044
pi043
pi042
pi041
pi040
pi039
pi038
pi037
pi036
pi035
pi034
pi033
pi032
pi031
pi030
pi029
pi028
pi027
pi026
pi025
pi024
pi023
pi022
pi021
pi020
pi019
pi018
pi017
pi016
pi015
pi014
pi013
pi012
pi011
pi010
pi009
pi008
pi007
pi006
pi005
pi004
pi003
pi002
pi001
pi000
}
set_output_delay -clock clk 0 {
po141
po140
po139
po138
po137
po136
po135
po134
po133
po132
po131
po130
po129
po128
po127
po126
po125
po124
po123
po122
po121
po120
po119
po118
po117
po116
po115
po114
po113
po112
po111
po110
po109
po108
po107
po106
po105
po104
po103
po102
po101
po100
po099
po098
po097
po096
po095
po094
po093
po092
po091
po090
po089
po088
po087
po086
po085
po084
po083
po082
po081
po080
po079
po078
po077
po076
po075
po074
po073
po072
po071
po070
po069
po068
po067
po066
po065
po064
po063
po062
po061
po060
po059
po058
po057
po056
po055
po054
po053
po052
po051
po050
po049
po048
po047
po046
po045
po044
po043
po042
po041
po040
po039
po038
po037
po036
po035
po034
po033
po032
po031
po030
po029
po028
po027
po026
po025
po024
po023
po022
po021
po020
po019
po018
po017
po016
po015
po014
po013
po012
po011
po010
po009
po008
po007
po006
po005
po004
po003
po002
po001
po000
}
