create_clock -name clk -period 10 {}
set_input_delay -clock clk 0 {
a[9]
a[8]
a[7]
a[6]
a[5]
a[4]
a[3]
a[31]
a[30]
a[2]
a[29]
a[28]
a[27]
a[26]
a[25]
a[24]
a[23]
a[22]
a[21]
a[20]
a[1]
a[19]
a[18]
a[17]
a[16]
a[15]
a[14]
a[13]
a[12]
a[11]
a[10]
a[0]
}
set_output_delay -clock clk 0 {
result[9]
result[8]
result[7]
result[6]
result[5]
result[4]
result[3]
result[31]
result[30]
result[2]
result[29]
result[28]
result[27]
result[26]
result[25]
result[24]
result[23]
result[22]
result[21]
result[20]
result[1]
result[19]
result[18]
result[17]
result[16]
result[15]
result[14]
result[13]
result[12]
result[11]
result[10]
result[0]
}
