create_clock -name clk -period 10 {}
set_input_delay -clock clk 0 {
b[9]
b[8]
b[7]
b[6]
b[63]
b[62]
b[61]
b[60]
b[5]
b[59]
b[58]
b[57]
b[56]
b[55]
b[54]
b[53]
b[52]
b[51]
b[50]
b[4]
b[49]
b[48]
b[47]
b[46]
b[45]
b[44]
b[43]
b[42]
b[41]
b[40]
b[3]
b[39]
b[38]
b[37]
b[36]
b[35]
b[34]
b[33]
b[32]
b[31]
b[30]
b[2]
b[29]
b[28]
b[27]
b[26]
b[25]
b[24]
b[23]
b[22]
b[21]
b[20]
b[1]
b[19]
b[18]
b[17]
b[16]
b[15]
b[14]
b[13]
b[12]
b[11]
b[10]
b[0]
a[9]
a[8]
a[7]
a[6]
a[63]
a[62]
a[61]
a[60]
a[5]
a[59]
a[58]
a[57]
a[56]
a[55]
a[54]
a[53]
a[52]
a[51]
a[50]
a[4]
a[49]
a[48]
a[47]
a[46]
a[45]
a[44]
a[43]
a[42]
a[41]
a[40]
a[3]
a[39]
a[38]
a[37]
a[36]
a[35]
a[34]
a[33]
a[32]
a[31]
a[30]
a[2]
a[29]
a[28]
a[27]
a[26]
a[25]
a[24]
a[23]
a[22]
a[21]
a[20]
a[1]
a[19]
a[18]
a[17]
a[16]
a[15]
a[14]
a[13]
a[12]
a[11]
a[10]
a[0]
}
set_output_delay -clock clk 0 {
f[9]
f[99]
f[98]
f[97]
f[96]
f[95]
f[94]
f[93]
f[92]
f[91]
f[90]
f[8]
f[89]
f[88]
f[87]
f[86]
f[85]
f[84]
f[83]
f[82]
f[81]
f[80]
f[7]
f[79]
f[78]
f[77]
f[76]
f[75]
f[74]
f[73]
f[72]
f[71]
f[70]
f[6]
f[69]
f[68]
f[67]
f[66]
f[65]
f[64]
f[63]
f[62]
f[61]
f[60]
f[5]
f[59]
f[58]
f[57]
f[56]
f[55]
f[54]
f[53]
f[52]
f[51]
f[50]
f[4]
f[49]
f[48]
f[47]
f[46]
f[45]
f[44]
f[43]
f[42]
f[41]
f[40]
f[3]
f[39]
f[38]
f[37]
f[36]
f[35]
f[34]
f[33]
f[32]
f[31]
f[30]
f[2]
f[29]
f[28]
f[27]
f[26]
f[25]
f[24]
f[23]
f[22]
f[21]
f[20]
f[1]
f[19]
f[18]
f[17]
f[16]
f[15]
f[14]
f[13]
f[12]
f[127]
f[126]
f[125]
f[124]
f[123]
f[122]
f[121]
f[120]
f[11]
f[119]
f[118]
f[117]
f[116]
f[115]
f[114]
f[113]
f[112]
f[111]
f[110]
f[10]
f[109]
f[108]
f[107]
f[106]
f[105]
f[104]
f[103]
f[102]
f[101]
f[100]
f[0]
}
