create_clock -name clk -period 10 {}
set_input_delay -clock clk 0 {
A[9]
A[99]
A[98]
A[97]
A[96]
A[95]
A[94]
A[93]
A[92]
A[91]
A[90]
A[8]
A[89]
A[88]
A[87]
A[86]
A[85]
A[84]
A[83]
A[82]
A[81]
A[80]
A[7]
A[79]
A[78]
A[77]
A[76]
A[75]
A[74]
A[73]
A[72]
A[71]
A[70]
A[6]
A[69]
A[68]
A[67]
A[66]
A[65]
A[64]
A[63]
A[62]
A[61]
A[60]
A[5]
A[59]
A[58]
A[57]
A[56]
A[55]
A[54]
A[53]
A[52]
A[51]
A[50]
A[4]
A[49]
A[48]
A[47]
A[46]
A[45]
A[44]
A[43]
A[42]
A[41]
A[40]
A[3]
A[39]
A[38]
A[37]
A[36]
A[35]
A[34]
A[33]
A[32]
A[31]
A[30]
A[2]
A[29]
A[28]
A[27]
A[26]
A[25]
A[24]
A[23]
A[22]
A[21]
A[20]
A[1]
A[19]
A[18]
A[17]
A[16]
A[15]
A[14]
A[13]
A[12]
A[127]
A[126]
A[125]
A[124]
A[123]
A[122]
A[121]
A[120]
A[11]
A[119]
A[118]
A[117]
A[116]
A[115]
A[114]
A[113]
A[112]
A[111]
A[110]
A[10]
A[109]
A[108]
A[107]
A[106]
A[105]
A[104]
A[103]
A[102]
A[101]
A[100]
A[0]
}
set_output_delay -clock clk 0 {
P[6]
P[5]
P[4]
P[3]
P[2]
P[1]
P[0]
F
}
