create_clock -name clk -period 10 {CK}
set_input_delay -clock clk 0 {
g99
g96
g95
g94
g93
g925
g922
g92
g919
g916
g913
g910
g91
g907
g904
g901
g90
g898
g895
g892
g89
g889
g886
g881
g88
g877
g873
g872
g87
g86
g85
g84
g83
g82
g750
g744
g743
g742
g741
g48
g47
g46
g45
g44
g43
g42
g41
g31
g30
g29
g28
g27
g23
g1961
g1960
g18
g1712
g1700
g1696
g1203
g1200
g1197
g1194
g1191
g1188
g1185
g1182
g1179
g1176
g1173
g1170
g109
g104
g103
g102
g101
g100
VDD
GND
}
set_output_delay -clock clk 0 {
g9961
g9451
g8986
g8985
g8984
g8983
g8982
g8981
g8980
g8979
g8978
g8977
g8976
g8566
g8565
g8564
g8563
g8562
g8561
g8352
g8349
g8347
g8340
g8335
g8331
g8328
g8323
g8318
g8316
g8313
g8271
g8062
g8061
g7744
g6955
g6949
g6942
g6932
g6926
g6920
g6842
g6285
g6284
g6283
g6282
g6281
g6280
g6279
g6278
g6277
g6276
g6275
g6274
g6273
g6272
g6271
g6270
g6269
g6268
g6267
g6266
g6265
g6264
g6263
g6262
g6261
g6260
g6259
g6258
g6257
g6256
g6255
g6254
g6253
g5816
g5659
g5658
g5105
g5101
g4888
g4887
g4216
g4215
g4214
g4213
g4212
g4211
g4210
g4209
g4208
g4207
g4206
g4205
g4204
g4203
g4202
g4201
g4200
g4199
g4198
g4197
g4196
g4195
g4194
g4193
g4192
g4191
g4181
g4180
g4179
g4178
g4177
g4176
g4175
g4174
g4173
g4172
g4171
g3327
g3069
g3007
g2986
g2648
g2612
g2611
g2610
g2609
g2608
g2607
g2606
g2605
g2604
g2603
g2602
g2601
g2355
g1957
g11489
g11206
g11163
g10801
g10628
g10465
g10463
g10461
g10459
g10457
g10455
g10379
g10377
}
