create_clock -name clk -period 10 {}
set_input_delay -clock clk 0 {
a[9]
a[8]
a[7]
a[6]
a[63]
a[62]
a[61]
a[60]
a[5]
a[59]
a[58]
a[57]
a[56]
a[55]
a[54]
a[53]
a[52]
a[51]
a[50]
a[4]
a[49]
a[48]
a[47]
a[46]
a[45]
a[44]
a[43]
a[42]
a[41]
a[40]
a[3]
a[39]
a[38]
a[37]
a[36]
a[35]
a[34]
a[33]
a[32]
a[31]
a[30]
a[2]
a[29]
a[28]
a[27]
a[26]
a[25]
a[24]
a[23]
a[22]
a[21]
a[20]
a[1]
a[19]
a[18]
a[17]
a[16]
a[15]
a[14]
a[13]
a[12]
a[11]
a[10]
a[0]
}
set_output_delay -clock clk 0 {
asquared[9]
asquared[99]
asquared[98]
asquared[97]
asquared[96]
asquared[95]
asquared[94]
asquared[93]
asquared[92]
asquared[91]
asquared[90]
asquared[8]
asquared[89]
asquared[88]
asquared[87]
asquared[86]
asquared[85]
asquared[84]
asquared[83]
asquared[82]
asquared[81]
asquared[80]
asquared[7]
asquared[79]
asquared[78]
asquared[77]
asquared[76]
asquared[75]
asquared[74]
asquared[73]
asquared[72]
asquared[71]
asquared[70]
asquared[6]
asquared[69]
asquared[68]
asquared[67]
asquared[66]
asquared[65]
asquared[64]
asquared[63]
asquared[62]
asquared[61]
asquared[60]
asquared[5]
asquared[59]
asquared[58]
asquared[57]
asquared[56]
asquared[55]
asquared[54]
asquared[53]
asquared[52]
asquared[51]
asquared[50]
asquared[4]
asquared[49]
asquared[48]
asquared[47]
asquared[46]
asquared[45]
asquared[44]
asquared[43]
asquared[42]
asquared[41]
asquared[40]
asquared[3]
asquared[39]
asquared[38]
asquared[37]
asquared[36]
asquared[35]
asquared[34]
asquared[33]
asquared[32]
asquared[31]
asquared[30]
asquared[2]
asquared[29]
asquared[28]
asquared[27]
asquared[26]
asquared[25]
asquared[24]
asquared[23]
asquared[22]
asquared[21]
asquared[20]
asquared[1]
asquared[19]
asquared[18]
asquared[17]
asquared[16]
asquared[15]
asquared[14]
asquared[13]
asquared[12]
asquared[127]
asquared[126]
asquared[125]
asquared[124]
asquared[123]
asquared[122]
asquared[121]
asquared[120]
asquared[11]
asquared[119]
asquared[118]
asquared[117]
asquared[116]
asquared[115]
asquared[114]
asquared[113]
asquared[112]
asquared[111]
asquared[110]
asquared[10]
asquared[109]
asquared[108]
asquared[107]
asquared[106]
asquared[105]
asquared[104]
asquared[103]
asquared[102]
asquared[101]
asquared[100]
asquared[0]
}
