create_clock -name clk -period 10 {CK}
set_input_delay -clock clk 0 {
VDD
GND
G9
G8
G7
G6
G5
G4
G3
G2
G13
G12
G11
G10
G1
G0
}
set_output_delay -clock clk 0 {
G552
G551
G550
G549
G548
G547
G546
G542
G539
G537
G535
G532
G530
G45
}
